In [1]:
import pandas as pd

In [2]:
pd.DataFrame({'Yes':[50,21],'No':[131,2]})

   Yes   No
0   50  131
1   21    2

In [3]:
Dataset= pd.read_csv("Data.csv")

In [4]:
Dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [5]:
Dataset.shape

(10, 4)

In [6]:
Dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [7]:
Dataset['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [8]:
Dataset['Country'][0]

'France'

In [9]:
Dataset['Country'][1]

'Spain'

In [10]:
Dataset['Country'][2]

'Germany'

In [11]:
Dataset['Country'][0:3]

0     France
1      Spain
2    Germany
Name: Country, dtype: object

In [12]:
Dataset.Country=='Germany'

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8     True
9    False
Name: Country, dtype: bool

In [13]:
Dataset.Country=='Spain'

0    False
1     True
2    False
3     True
4    False
5    False
6     True
7    False
8    False
9    False
Name: Country, dtype: bool

In [14]:
Dataset.Country=='France'

0     True
1    False
2    False
3    False
4    False
5     True
6    False
7     True
8    False
9     True
Name: Country, dtype: bool

In [15]:
Dataset.loc[Dataset.Country=='Germany']

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [16]:
Dataset.loc[Dataset.Country=='Spain']

  Country   Age   Salary Purchased
1   Spain  27.0  48000.0       Yes
3   Spain  38.0  61000.0        No
6   Spain   NaN  52000.0        No

In [17]:
Dataset.loc[Dataset.Country=='France']

  Country   Age   Salary Purchased
0  France  44.0  72000.0        No
5  France  35.0  58000.0       Yes
7  France  48.0  79000.0       Yes
9  France  37.0  67000.0       Yes

In [18]:
Germany_column=Dataset.loc[Dataset.Country=='Germany']

In [19]:
Germany_column

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [20]:
Spain_column=Dataset.loc[Dataset.Country=='Spain']

In [21]:
Spain_column

  Country   Age   Salary Purchased
1   Spain  27.0  48000.0       Yes
3   Spain  38.0  61000.0        No
6   Spain   NaN  52000.0        No

In [22]:
France_column=Dataset.loc[Dataset.Country=='France']

In [23]:
France_column

  Country   Age   Salary Purchased
0  France  44.0  72000.0        No
5  France  35.0  58000.0       Yes
7  France  48.0  79000.0       Yes
9  France  37.0  67000.0       Yes

In [24]:
Germany_column.to_csv('germanyData.csv')

In [25]:
France_column.to_csv('franceData.csv')

In [26]:
Spain_column.to_csv('spainData.csv')

In [29]:
Dataset.loc[Dataset.Salary.isnull()]

   Country   Age  Salary Purchased
4  Germany  40.0     NaN       Yes

In [30]:
Dataset.loc[Dataset.Salary.notnull()]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [34]:
Dataset.loc[2,'Salary']=250000

In [33]:
Dataset

   Country   Age    Salary Purchased
0   France  44.0   72000.0        No
1    Spain  27.0   48000.0       Yes
2  Germany  30.0  250000.0        No
3    Spain  38.0   61000.0        No
4  Germany  40.0       NaN       Yes
5   France  35.0   58000.0       Yes
6    Spain   NaN   52000.0        No
7   France  48.0   79000.0       Yes
8  Germany  50.0   83000.0        No
9   France  37.0   67000.0       Yes

In [35]:
Dataset.Salary.describe()

count         9.000000
mean      85555.555556
std       62767.649134
min       48000.000000
25%       58000.000000
50%       67000.000000
75%       79000.000000
max      250000.000000
Name: Salary, dtype: float64

In [37]:
Dataset.Salary.unique()

array([ 72000.,  48000., 250000.,  61000.,     nan,  58000.,  52000.,
        79000.,  83000.,  67000.])

In [39]:
Dataset.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [41]:
Dataset.Salary.dtype

dtype('float64')

In [43]:
Dataset.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object